УправДом/src/Documents/ОплатаТКО/ОплатаТКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаТКО</name>
  <registerRecords>InformationRegister.СведенияПоТКО</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧеловек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/НормыКомунальныхУслуг/НормыКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыКомунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Норматив</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачалаДейсвия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/InformationRegisters/ЦеныКомунальныхУслуг/ЦеныКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКомунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачалаДейсвия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/ОплатаТКО/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнениеШапкиНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПлатежей.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ВидыПлатежей КАК ВидыПлатежей
		|ГДЕ
		|	ВидыПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидПлатежа);
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	
		 Объект.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	Иначе 
		 Сообщить("Ошибка.Заполните справочники в настройках")
	 КонецЕсли;
	 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеШапкиНаСервере();
	Если Объект.ДанныеПлатежа.Количество() = 0 Тогда
		Элементы.ДанныеПлатежа.ДобавитьСтроку();
		КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗаполнениеТЧНаСервере()
	 //Получаем количество проживающих
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СоставСемьи.УчитыватьВПлатежах) КАК Количество
		|ИЗ
		|	Справочник.СоставСемьи КАК СоставСемьи
		|ГДЕ
		|	СоставСемьи.УчитыватьВПлатежах = Истина";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	
		КоличествоЧеловек = Выборка.Количество;	
	Иначе 
		Сообщить("Заполните справочник соотав семьи(столбец учитывать в платежах)")
	КонецЕсли;
	
	
	 //получаем актуальный норматив
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(НормыКомунальныхУслугСрезПоследних.Норматив, 0) КАК Норматив
		|ИЗ
		|	РегистрСведений.НормыКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ВидПлатежа
		|				И КодМесяца <= &КодМесяца) КАК НормыКомунальныхУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
	 	Выборка = РезультатЗапроса.Выбрать();	
	 	Выборка.Следующий();
	 
        Норматив = Выборка.Норматив;
	Иначе
		Сообщить("Норматив не найден");
	КонецЕсли;

	    
    // получаем актуальную цену по ТКО
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныКомунальныхУслугСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ВидПлатежа
		|				И КодМесяца <= &КодМесяца) КАК ЦеныКомунальныхУслугСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныКомунальныхУслугСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
	 	Выборка = РезультатЗапроса.Выбрать();	
	 	Выборка.Следующий();
	 
        Цена = Выборка.Цена;
	Иначе
		Сообщить("Цена не найдена");
	КонецЕсли;
	
   
      ДанныеТЧ = Новый Структура;
	  ДанныеТЧ.Вставить("КоличествоЧеловек",КоличествоЧеловек);
	  ДанныеТЧ.Вставить("Норматив",Норматив);
	  ДанныеТЧ.Вставить("Цена",Цена);
	  Возврат ДанныеТЧ;
	
КонецФункции



&НаКлиенте
Процедура ОплачиваемыйМесяцПриИзменении(Элемент)
	СтрокаТЧ = ЗаполнениеТЧНаСервере();
	ТекДан = Элементы.ДанныеПлатежа.ТекущиеДанные;
	ТекДан.КоличествоЧеловек = СтрокаТЧ.КоличествоЧеловек;
	ТекДан.Норматив = СтрокаТЧ.Норматив;
	ТекДан.Цена = СтрокаТЧ.Цена;
	Если ТекДан.КоличествоЧеловек и  ТекДан.Норматив и ТекДан.Цена <> Неопределено Тогда
		ТекДан.СуммаПлатежа = ТекДан.Норматив * ТекДан.КоличествоЧеловек * ТекДан.Цена;
	КонецЕсли;
КонецПроцедуры

// РАБОТА С КАРТИНКАМИ

&НаКлиенте
Асинх Процедура ЗагрузитьКвитанцию(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеКвитанция = ОбещаниеФайла.Адрес; 
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеКвитанция.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЭтоАдресВременногоХранилища(ИзображениеКвитанция) Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеКвитанция));
	//ИначеЕсли ИзображениеКвитанция ="Очистить" Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли; 
	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ИзображениеКвитанция);

	
	//Если ЭтоАдресВременногоХранилища(ИзображениеЧек) Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеЧек));
	//ИначеЕсли ИзображениеЧек ="Очистить" Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли;
    ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ИзображениеЧек);
	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ИзображениеКвитанция = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КвитанцияИзображение");
	ИзображениеКвитанция = ТекущийОбъект.КвитанцияИзображение.Получить();
	
	//ИзображениеЧек = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ЧекИзображение");
	ИзображениеЧек = ТекущийОбъект.ЧекИзображение.Получить();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКвитанцию(Команда)
	
	ИзображениеКвитанция = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьЧек(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеЧек = ОбещаниеФайла.Адрес;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеЧек.ПрочитатьАсинх(Поток);

		
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧек(Команда)
	ИзображениеЧек = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры
